package ru.gb.springdemo.hw;

public class HomeWork7 {
    /*
    Фреймворк Spring (семинары)
Урок 7. Spring Security. Работа с JWT. Защита от основных видов атак.
1. Для ресурсов, возвращающих HTML-страницы, реализовать авторизацию через login-форму.
Остальные /api ресурсы, возвращающие JSON, закрывать не нужно!
2.1* Реализовать таблицы User(id, name, password) и Role(id, name), связанные многие ко многим
2.2* Реализовать UserDetailsService, который предоставляет данные из БД (таблицы User и Role)
3.3* Ресурсы выдачей (issue) доступны обладателям роли admin
3.4* Ресурсы читателей (reader) доступны всем обладателям роли reader
3.5* Ресурсы книг (books) доступны всем авторизованным пользователям
     */
}
